Revit 2027 API
ParameterTypeId.IsDepthParam Property
 "Depth"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId IsDepthParam { get; }
Public Shared ReadOnly Property IsDepthParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ IsDepthParam {
	ForgeTypeId^ get ();
}
static member IsDepthParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace